src/cf/src/DataProcessors/Дашборд/Дашборд.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Дашборд</name>
  <comment>Аналитические панели с показателями и диаграммами. Одна форма — одна панель, у каждой своя команда.</comment>
</mdclass:DataProcessor>

src/cf/src/InformationRegisters/ИсторияЗаказовПокупателейПоСтатусам/ИсторияЗаказовПокупателейПоСтатусам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияЗаказовПокупателейПоСтатусам</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СтатусЗаказаПокупателя</name>
    <type>
      <types>EnumRef.СтатусыЗаказовПокупателя</types>
    </type>
  </resources>
  <attributes>
    <name>ДокументПродажи</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоляОбеспечения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоляПоступления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоляВыпуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоляОтгрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоляОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Индикатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/AccumulationRegisters/ТоварыВПереработке/ТоварыВПереработке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыВПереработке</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <comment>Переработчик, у которого находятся товары</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПриходныйДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПартии</name>
    <comment>Реквизит для ускорения выборки по FIFO</comment>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПередачаВПереработку</name>
    <type>
      <types>DocumentRef.ПередачаВПереработку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Enums/СтатусыЗаказовПокупателя/СтатусыЗаказовПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаказовПокупателя</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ВПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>ПереданСубподрядчику</name>
  </enumValues>
  <enumValues>
    <name>ПолученОтСубподрядчика</name>
  </enumValues>
  <enumValues>
    <name>Собран</name>
  </enumValues>
  <enumValues>
    <name>Отгружен</name>
  </enumValues>
  <enumValues>
    <name>Доставлен</name>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>ФормируетсяПотребность</name>
  </enumValues>
  <enumValues>
    <name>ЗаказПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ВосполнениеПотребности</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетОплаты</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <posting>Allow</posting>
  <registerRecords>AccumulationRegister.ПотребностиПроизводства</registerRecords>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.КоммерческоеПредложение</types>
    </type>
  </attributes>
  <attributes>
    <name>ECommerce</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокументаЭлектронногоОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказСWEBСайта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокументаЭлектронногоОбмена</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерПодтвердилПроверилОстаток</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийЗаказаПокупателя</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаSKU</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>DefinedType.ПроцентСкидки</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаЦену</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Техкарта</name>
      <type>
        <types>DocumentRef.ТехнологическаяКарта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧМатериалы</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтрокиПродукции</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтрокиРодителя</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗаЕдиницу</name>
      <type>
        <types>DefinedType.НормаРасхода</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/DataProcessors/Дашборд/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Создаёт на форме реквизиты и элементы производственного дашборда:
// карточки показателей, достижения и диаграммы выпуска.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, на которой размещается дашборд.
//  Родитель - ГруппаФормы, Неопределено - группа для элементов; Неопределено - корень формы.
//
Процедура ПостроитьПроизводственныйДашборд(Форма, Родитель = Неопределено) Экспорт

	ТипДиаграмма = Новый ОписаниеТипов("Диаграмма");
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ДиаграммаВыпускПоДням", ТипДиаграмма));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ДиаграммаСтатусыЗаказов", ТипДиаграмма));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ДиаграммаТопПродукции", ТипДиаграмма));
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);

	ГруппаПоказателей = ДобавитьГруппу(Форма, "ГруппаПроизводствоПоказатели", Ложь, Родитель);
	ДобавитьКарточку(Форма, ГруппаПоказателей, "ЗаказовВПроизводстве",
		НСтр("ru = 'Заказов в производстве'; fr = 'Commandes en production';
			|en = 'Orders in production'; es = 'Pedidos en producción'"));
	ДобавитьКарточку(Форма, ГруппаПоказателей, "ВыпущеноЗаМесяц",
		НСтр("ru = 'Выпущено за 30 дней'; fr = 'Produit sur 30 jours';
			|en = 'Produced, 30 days'; es = 'Producido, 30 días'"));
	ДобавитьКарточку(Форма, ГруппаПоказателей, "ВыпусковСегодня",
		НСтр("ru = 'Выпусков сегодня'; fr = 'Productions aujourd''hui';
			|en = 'Releases today'; es = 'Producciones hoy'"));
	ДобавитьКарточку(Форма, ГруппаПоказателей, "ПозицийВПереработке",
		НСтр("ru = 'Позиций в переработке'; fr = 'Articles en sous-traitance';
			|en = 'Items at subcontractors'; es = 'Artículos en maquila'"));

	ГруппаДостижений = ДобавитьГруппу(Форма, "ГруппаПроизводствоДостижения", Ложь, Родитель);
	ДобавитьКарточку(Форма, ГруппаДостижений, "СерияВыпусков",
		НСтр("ru = 'Серия дней с выпуском'; fr = 'Série de jours avec production';
			|en = 'Production day streak'; es = 'Racha de días con producción'"));
	ДобавитьКарточку(Форма, ГруппаДостижений, "РекордДня",
		НСтр("ru = 'Рекорд дня за 30 дней'; fr = 'Record du jour sur 30 jours';
			|en = 'Best day, 30 days'; es = 'Récord del día, 30 días'"));
	ДобавитьКарточку(Форма, ГруппаДостижений, "ПрогрессМесяца",
		НСтр("ru = 'Месяц к прошлому месяцу'; fr = 'Mois vs mois précédent';
			|en = 'Month vs previous month'; es = 'Mes vs mes anterior'"));
	ДобавитьКарточку(Форма, ГруппаДостижений, "ПросроченоОтгрузок",
		НСтр("ru = 'Просроченные отгрузки'; fr = 'Expéditions en retard';
			|en = 'Overdue shipments'; es = 'Envíos atrasados'"));

	ГруппаВерхнихДиаграмм = ДобавитьГруппу(Форма, "ГруппаПроизводствоДиаграммыВерх", Истина, Родитель);
	ДобавитьДиаграмму(Форма, ГруппаВерхнихДиаграмм, "ДиаграммаВыпускПоДням",
		НСтр("ru = 'Выпуск продукции по дням'; fr = 'Production par jour';
			|en = 'Output by day'; es = 'Producción por día'"));
	ДобавитьДиаграмму(Форма, ГруппаВерхнихДиаграмм, "ДиаграммаСтатусыЗаказов",
		НСтр("ru = 'Активные заказы по статусам'; fr = 'Commandes actives par statut';
			|en = 'Active orders by status'; es = 'Pedidos activos por estado'"));

	ГруппаНижнихДиаграмм = ДобавитьГруппу(Форма, "ГруппаПроизводствоДиаграммыНиз", Истина, Родитель);
	ДобавитьДиаграмму(Форма, ГруппаНижнихДиаграмм, "ДиаграммаТопПродукции",
		НСтр("ru = 'Топ продукции за 30 дней'; fr = 'Top produits sur 30 jours';
			|en = 'Top products, 30 days'; es = 'Top productos, 30 días'"));

КонецПроцедуры

// Пересчитывает и выводит данные производственного дашборда,
// построенного процедурой ПостроитьПроизводственныйДашборд.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма с построенным производственным дашбордом.
//
Процедура ОбновитьПроизводственныйДашборд(Форма) Экспорт

	// Дашборд агрегирует данные регистров только на чтение; права ролей на сами регистры не требуются.
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on

	Данные = ДанныеПроизводства();

	Форма.Элементы.ЗначениеЗаказовВПроизводстве.Заголовок = ФорматЧисла(Данные.ЗаказовВПроизводстве);
	Форма.Элементы.ЗначениеВыпущеноЗаМесяц.Заголовок = ФорматЧисла(Данные.ВыпущеноЗаМесяц);
	Форма.Элементы.ЗначениеВыпусковСегодня.Заголовок = ФорматЧисла(Данные.ВыпусковСегодня);
	Форма.Элементы.ЗначениеПозицийВПереработке.Заголовок = ФорматЧисла(Данные.ПозицийВПереработке);

	Форма.Элементы.ЗначениеСерияВыпусков.Заголовок = ПредставлениеСерии(Данные.СерияДней);
	Форма.Элементы.ЗначениеРекордДня.Заголовок = ПредставлениеРекорда(Данные.РекордДня, Данные.ДеньРекорда);
	Форма.Элементы.ЗначениеПрогрессМесяца.Заголовок =
		ПредставлениеПрогресса(Данные.ВыпускТекущегоМесяца, Данные.ВыпускПрошлогоМесяца);
	Форма.Элементы.ЗначениеПросроченоОтгрузок.Заголовок = ПредставлениеПросрочки(Данные.ПросроченоОтгрузок);

	ЗаполнитьДиаграммуВыпуска(Форма, Данные.ВыпускПоДням, Данные.НачалоПериодаДиаграмм);
	ЗаполнитьДиаграммуСтатусов(Форма, Данные.ЗаказыПоСтатусам);
	ЗаполнитьДиаграммуТопПродукции(Форма, Данные.ТопПродукции);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПостроениеЭлементов

Функция ДобавитьГруппу(Форма, Имя, РастягиватьПоВертикали, Родитель)

	Если Родитель = Неопределено Тогда
		Группа = Форма.Элементы.Добавить(Имя, Тип("ГруппаФормы"));
	Иначе
		Группа = Форма.Элементы.Добавить(Имя, Тип("ГруппаФормы"), Родитель);
	КонецЕсли;
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Группа.ОтображатьЗаголовок = Ложь;
	Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
	Группа.РастягиватьПоГоризонтали = Истина;
	Группа.РастягиватьПоВертикали = РастягиватьПоВертикали;
	Возврат Группа;

КонецФункции

Процедура ДобавитьКарточку(Форма, Родитель, Имя, Подпись)

	Карточка = Форма.Элементы.Добавить("Карточка" + Имя, Тип("ГруппаФормы"), Родитель);
	Карточка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Карточка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	Карточка.ОтображатьЗаголовок = Ложь;
	Карточка.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение;
	Карточка.РастягиватьПоГоризонтали = Истина;

	ЭлементПодписи = Форма.Элементы.Добавить("Подпись" + Имя, Тип("ДекорацияФормы"), Карточка);
	ЭлементПодписи.Заголовок = Подпись;
	ЭлементПодписи.ЦветТекста = ЦветаСтиля.Цвет_ПоясняющийТекст;

	ЭлементЗначения = Форма.Элементы.Добавить("Значение" + Имя, Тип("ДекорацияФормы"), Карточка);
	ЭлементЗначения.Заголовок = "0";
	ЭлементЗначения.Шрифт = ШрифтыСтиля.Шрифт_Основной_Увеличенный;

КонецПроцедуры

Процедура ДобавитьДиаграмму(Форма, Родитель, ИмяРеквизита, Заголовок)

	Поле = Форма.Элементы.Добавить("Поле" + ИмяРеквизита, Тип("ПолеФормы"), Родитель);
	Поле.Вид = ВидПоляФормы.ПолеДиаграммы;
	Поле.ПутьКДанным = ИмяРеквизита;
	Поле.Заголовок = Заголовок;
	Поле.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	Поле.РастягиватьПоГоризонтали = Истина;
	Поле.РастягиватьПоВертикали = Истина;
	Поле.Высота = 12;

КонецПроцедуры

#КонецОбласти

#Область ДанныеИРасчеты

Функция ДанныеПроизводства()

	ТекущаяДата = ТекущаяДатаСеанса();
	НачалоСегодня = НачалоДня(ТекущаяДата);
	КонецПериода = КонецДня(ТекущаяДата);
	НачалоПериодаДиаграмм = НачалоДня(ТекущаяДата - (ДнейВПериоде() - 1) * СекундВСутках());
	НачалоПрошлогоМесяца = НачалоМесяца(ДобавитьМесяц(ТекущаяДата, -1));
	НачалоПериодаДанных = Мин(НачалоПериодаДиаграмм, НачалоПрошлогоМесяца);

	СтатусыЗавершенные = Новый Массив;
	СтатусыЗавершенные.Добавить(Перечисления.СтатусыЗаказовПокупателя.Отгружен);
	СтатусыЗавершенные.Добавить(Перечисления.СтатусыЗаказовПокупателя.Доставлен);

	СтатусыПроизводства = Новый Массив;
	СтатусыПроизводства.Добавить(Перечисления.СтатусыЗаказовПокупателя.ВПроизводстве);
	СтатусыПроизводства.Добавить(Перечисления.СтатусыЗаказовПокупателя.ПереданСубподрядчику);
	СтатусыПроизводства.Добавить(Перечисления.СтатусыЗаказовПокупателя.ПолученОтСубподрядчика);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоСегодня", НачалоСегодня);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("НачалоПериодаДиаграмм", НачалоПериодаДиаграмм);
	Запрос.УстановитьПараметр("НачалоПериодаДанных", НачалоПериодаДанных);
	Запрос.УстановитьПараметр("СтатусыЗавершенные", СтатусыЗавершенные);
	// Дашборду нужны все актуальные статусы и весь остаток переработки,
	// отбор в виртуальных таблицах не сузить.
	// BSLLS:VirtualTableCallWithoutParameters-off
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СрезСтатусов.ЗаказПокупателя КАК Заказ,
	|	СрезСтатусов.СтатусЗаказаПокупателя КАК Статус
	|ПОМЕСТИТЬ ВТСтатусы
	|ИЗ
	|	РегистрСведений.ИсторияЗаказовПокупателейПоСтатусам.СрезПоследних КАК СрезСтатусов
	|ГДЕ
	|	НЕ СрезСтатусов.СтатусЗаказаПокупателя В (&СтатусыЗавершенные)
	|;
	|ВЫБРАТЬ
	|	Статусы.Статус КАК Статус,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Статусы.Заказ) КАК Заказов
	|ИЗ
	|	ВТСтатусы КАК Статусы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|		ПО Статусы.Заказ = ЗаказПокупателя.Ссылка
	|ГДЕ
	|	НЕ ЗаказПокупателя.ПометкаУдаления
	|СГРУППИРОВАТЬ ПО
	|	Статусы.Статус
	|;
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Статусы.Заказ) КАК Заказов
	|ИЗ
	|	ВТСтатусы КАК Статусы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|		ПО Статусы.Заказ = ЗаказПокупателя.Ссылка
	|ГДЕ
	|	НЕ ЗаказПокупателя.ПометкаУдаления
	|	И ЗаказПокупателя.ДатаОтгрузки <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ЗаказПокупателя.ДатаОтгрузки < &НачалоСегодня
	|;
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВыпускПродукции.Дата, ДЕНЬ) КАК День,
	|	СУММА(ГотоваяПродукция.Количество) КАК Количество
	|ИЗ
	|	Документ.ВыпускПродукции КАК ВыпускПродукции
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВыпускПродукции.ТЧГотоваяПродукция КАК ГотоваяПродукция
	|		ПО ГотоваяПродукция.Ссылка = ВыпускПродукции.Ссылка
	|ГДЕ
	|	ВыпускПродукции.Проведен
	|	И ВыпускПродукции.Дата МЕЖДУ &НачалоПериодаДанных И &КонецПериода
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ВыпускПродукции.Дата, ДЕНЬ)
	|УПОРЯДОЧИТЬ ПО
	|	День
	|;
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ВыпускПродукции.Ссылка) КАК Выпусков
	|ИЗ
	|	Документ.ВыпускПродукции КАК ВыпускПродукции
	|ГДЕ
	|	ВыпускПродукции.Проведен
	|	И ВыпускПродукции.Дата МЕЖДУ &НачалоСегодня И &КонецПериода
	|;
	|ВЫБРАТЬ ПЕРВЫЕ 5
	|	ГотоваяПродукция.Номенклатура КАК Номенклатура,
	|	СУММА(ГотоваяПродукция.Количество) КАК Количество
	|ИЗ
	|	Документ.ВыпускПродукции КАК ВыпускПродукции
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВыпускПродукции.ТЧГотоваяПродукция КАК ГотоваяПродукция
	|		ПО ГотоваяПродукция.Ссылка = ВыпускПродукции.Ссылка
	|ГДЕ
	|	ВыпускПродукции.Проведен
	|	И ВыпускПродукции.Дата МЕЖДУ &НачалоПериодаДиаграмм И &КонецПериода
	|СГРУППИРОВАТЬ ПО
	|	ГотоваяПродукция.Номенклатура
	|УПОРЯДОЧИТЬ ПО
	|	Количество УБЫВ
	|;
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТоварыВПереработкеОстатки.Номенклатура) КАК Позиций
	|ИЗ
	|	РегистрНакопления.ТоварыВПереработке.Остатки() КАК ТоварыВПереработкеОстатки";
	// BSLLS:VirtualTableCallWithoutParameters-on

	Пакет = Запрос.ВыполнитьПакет();

	Данные = Новый Структура;
	Данные.Вставить("НачалоПериодаДиаграмм", НачалоПериодаДиаграмм);
	Данные.Вставить("ЗаказыПоСтатусам", Пакет[1].Выгрузить());
	Данные.Вставить("ВыпускПоДням", Пакет[3].Выгрузить());
	Данные.Вставить("ТопПродукции", Пакет[5].Выгрузить());

	ВыборкаПросрочки = Пакет[2].Выбрать();
	ВыборкаПросрочки.Следующий();
	Данные.Вставить("ПросроченоОтгрузок", ВыборкаПросрочки.Заказов);

	ВыборкаСегодня = Пакет[4].Выбрать();
	ВыборкаСегодня.Следующий();
	Данные.Вставить("ВыпусковСегодня", ВыборкаСегодня.Выпусков);

	ВыборкаПереработки = Пакет[6].Выбрать();
	ВыборкаПереработки.Следующий();
	Данные.Вставить("ПозицийВПереработке", ВыборкаПереработки.Позиций);

	ЗаказовВПроизводстве = 0;
	Для Каждого СтрокаСтатуса Из Данные.ЗаказыПоСтатусам Цикл
		Если СтатусыПроизводства.Найти(СтрокаСтатуса.Статус) <> Неопределено Тогда
			ЗаказовВПроизводстве = ЗаказовВПроизводстве + СтрокаСтатуса.Заказов;
		КонецЕсли;
	КонецЦикла;
	Данные.Вставить("ЗаказовВПроизводстве", ЗаказовВПроизводстве);

	ЗаполнитьПоказателиВыпуска(Данные, НачалоСегодня, НачалоПериодаДиаграмм, НачалоПрошлогоМесяца);

	Возврат Данные;

КонецФункции

Процедура ЗаполнитьПоказателиВыпуска(Данные, НачалоСегодня, НачалоПериодаДиаграмм, НачалоПрошлогоМесяца)

	НачалоТекущегоМесяца = НачалоМесяца(НачалоСегодня);

	ВыпущеноЗаМесяц = 0;
	ВыпускТекущегоМесяца = 0;
	ВыпускПрошлогоМесяца = 0;
	РекордДня = 0;
	ДеньРекорда = Дата(1, 1, 1);
	ДниСВыпуском = Новый Соответствие;

	Для Каждого СтрокаДня Из Данные.ВыпускПоДням Цикл
		Если СтрокаДня.Количество > 0 Тогда
			ДниСВыпуском.Вставить(СтрокаДня.День, Истина);
		КонецЕсли;
		Если СтрокаДня.День >= НачалоПериодаДиаграмм Тогда
			ВыпущеноЗаМесяц = ВыпущеноЗаМесяц + СтрокаДня.Количество;
			Если СтрокаДня.Количество > РекордДня Тогда
				РекордДня = СтрокаДня.Количество;
				ДеньРекорда = СтрокаДня.День;
			КонецЕсли;
		КонецЕсли;
		Если СтрокаДня.День >= НачалоТекущегоМесяца Тогда
			ВыпускТекущегоМесяца = ВыпускТекущегоМесяца + СтрокаДня.Количество;
		КонецЕсли;
		Если СтрокаДня.День >= НачалоПрошлогоМесяца И СтрокаДня.День < НачалоТекущегоМесяца Тогда
			ВыпускПрошлогоМесяца = ВыпускПрошлогоМесяца + СтрокаДня.Количество;
		КонецЕсли;
	КонецЦикла;

	// Серия непрерывных дней с выпуском; день без выпуска сегодня серию не рвет - день еще не кончился.
	СерияДней = 0;
	День = НачалоСегодня;
	Если ДниСВыпуском[День] = Неопределено Тогда
		День = День - СекундВСутках();
	КонецЕсли;
	Пока ДниСВыпуском[День] <> Неопределено Цикл
		СерияДней = СерияДней + 1;
		День = День - СекундВСутках();
	КонецЦикла;

	Данные.Вставить("ВыпущеноЗаМесяц", ВыпущеноЗаМесяц);
	Данные.Вставить("ВыпускТекущегоМесяца", ВыпускТекущегоМесяца);
	Данные.Вставить("ВыпускПрошлогоМесяца", ВыпускПрошлогоМесяца);
	Данные.Вставить("РекордДня", РекордДня);
	Данные.Вставить("ДеньРекорда", ДеньРекорда);
	Данные.Вставить("СерияДней", СерияДней);

КонецПроцедуры

Функция ПредставлениеСерии(СерияДней)

	СерияДостойнаяОгня = 3;
	Шаблон = НСтр("ru = '%1 дн.'; fr = '%1 j'; en = '%1 d'; es = '%1 d'");
	Представление = СтрШаблон(Шаблон, ФорматЧисла(СерияДней));
	Если СерияДней >= СерияДостойнаяОгня Тогда
		Представление = "🔥 " + Представление;
	КонецЕсли;
	Возврат Представление;

КонецФункции

Функция ПредставлениеРекорда(РекордДня, ДеньРекорда)

	Если РекордДня = 0 Тогда
		Возврат "-";
	КонецЕсли;
	Возврат "🏆 " + ФорматЧисла(РекордДня) + " · " + Формат(ДеньРекорда, "ДФ=dd.MM");

КонецФункции

Функция ПредставлениеПрогресса(ВыпускТекущегоМесяца, ВыпускПрошлогоМесяца)

	Если ВыпускПрошлогоМесяца = 0 Тогда
		Возврат ?(ВыпускТекущегоМесяца > 0, "🚀 -", "-");
	КонецЕсли;

	СтоПроцентов = 100;
	КодЯчейкиЗаполненной = 9608;
	КодЯчейкиПустой = 9617;
	Процент = Окр(ВыпускТекущегоМесяца / ВыпускПрошлогоМесяца * СтоПроцентов);
	ДлинаШкалы = 10;
	Заполнено = Мин(ДлинаШкалы, Цел(Процент * ДлинаШкалы / СтоПроцентов));
	Шкала = "";
	Для Ячейка = 1 По ДлинаШкалы Цикл
		Шкала = Шкала + ?(Ячейка <= Заполнено, Символ(КодЯчейкиЗаполненной), Символ(КодЯчейкиПустой));
	КонецЦикла;
	Возврат Шкала + " " + ФорматЧисла(Процент) + "%" + ?(Процент >= СтоПроцентов, " 🚀", "");

КонецФункции

Функция ПредставлениеПросрочки(ПросроченоОтгрузок)

	Возврат ?(ПросроченоОтгрузок = 0, "✅ 0", "⚠ " + ФорматЧисла(ПросроченоОтгрузок));

КонецФункции

Функция ФорматЧисла(Значение)

	Число = Значение;
	Если Число = NULL Или Число = Неопределено Тогда
		Число = 0;
	КонецЕсли;
	Возврат Формат(Число, "ЧДЦ=0; ЧРГ=' '; ЧН=0");

КонецФункции

Функция ДнейВПериоде()

	Возврат 30;

КонецФункции

Функция СекундВСутках()

	Возврат 86400;

КонецФункции

#КонецОбласти

#Область Диаграммы

Процедура ЗаполнитьДиаграммуВыпуска(Форма, ВыпускПоДням, НачалоПериодаДиаграмм)

	Диаграмма = Форма["ДиаграммаВыпускПоДням"];
	Диаграмма.Обновление = Ложь;
	Диаграмма.Очистить();
	Диаграмма.ТипДиаграммы = ТипДиаграммы.Гистограмма;
	Серия = Диаграмма.Серии.Добавить(НСтр("ru = 'Выпуск'; fr = 'Production'; en = 'Output'; es = 'Producción'"));
	Для Каждого СтрокаДня Из ВыпускПоДням Цикл
		Если СтрокаДня.День < НачалоПериодаДиаграмм Тогда
			Продолжить;
		КонецЕсли;
		Точка = Диаграмма.Точки.Добавить(Формат(СтрокаДня.День, "ДФ=dd.MM"));
		Диаграмма.УстановитьЗначение(Точка, Серия, СтрокаДня.Количество);
	КонецЦикла;
	Диаграмма.Обновление = Истина;

КонецПроцедуры

Процедура ЗаполнитьДиаграммуСтатусов(Форма, ЗаказыПоСтатусам)

	Диаграмма = Форма["ДиаграммаСтатусыЗаказов"];
	Диаграмма.Обновление = Ложь;
	Диаграмма.Очистить();
	Диаграмма.ТипДиаграммы = ТипДиаграммы.Круговая;
	Серия = Диаграмма.Серии.Добавить(НСтр("ru = 'Заказы'; fr = 'Commandes'; en = 'Orders'; es = 'Pedidos'"));
	ПустойСтатус = НСтр("ru = 'Без статуса'; fr = 'Sans statut'; en = 'No status'; es = 'Sin estado'");
	Для Каждого СтрокаСтатуса Из ЗаказыПоСтатусам Цикл
		ИмяСтатуса = Строка(СтрокаСтатуса.Статус);
		Если Не ЗначениеЗаполнено(СтрокаСтатуса.Статус) Тогда
			ИмяСтатуса = ПустойСтатус;
		КонецЕсли;
		Точка = Диаграмма.Точки.Добавить(ИмяСтатуса);
		Диаграмма.УстановитьЗначение(Точка, Серия, СтрокаСтатуса.Заказов);
	КонецЦикла;
	Диаграмма.Обновление = Истина;

КонецПроцедуры

Процедура ЗаполнитьДиаграммуТопПродукции(Форма, ТопПродукции)

	Диаграмма = Форма["ДиаграммаТопПродукции"];
	Диаграмма.Обновление = Ложь;
	Диаграмма.Очистить();
	Диаграмма.ТипДиаграммы = ТипДиаграммы.ГистограммаГоризонтальная;
	Серия = Диаграмма.Серии.Добавить(НСтр("ru = 'Выпущено'; fr = 'Produit'; en = 'Produced'; es = 'Producido'"));
	Для Каждого СтрокаТопа Из ТопПродукции Цикл
		Точка = Диаграмма.Точки.Добавить(Строка(СтрокаТопа.Номенклатура));
		Диаграмма.УстановитьЗначение(Точка, Серия, СтрокаТопа.Количество);
	КонецЦикла;
	Диаграмма.Обновление = Истина;

КонецПроцедуры

#КонецОбласти

#КонецОбласти
